import java.util.Random;

public class ChemicalElements implements Topics{

    private static final String[] words = {
            "водород", "гелий", "литий", "бериллий", "бор", "углерод", "азот", "кислород",
            "фтор", "неон", "натрий", "магний", "алюминий", "кремний", "фосфор", "сера",
            "хлор", "аргон", "калий", "кальций", "скандий", "титан", "ванадий", "хром",
            "марганец", "железо", "кобальт", "никель", "медь", "цинк", "галлий", "германий",
            "мышьяк", "селен", "бром", "криптон", "рубидий", "стронций", "иттрий", "цирконий",
            "ниобий", "молибден", "технеций", "рутений", "родий", "палладий", "серебро",
            "кадмий", "индий", "олово", "сурьма", "теллур", "иод", "ксенон", "цезий", "барий",
            "лантан", "церий", "празеодим", "неодим", "прометий", "самарий", "европий", "гадолиний",
            "тербий", "диспрозий", "гольмий", "эрбий", "тулий", "иттербий", "лютеций", "оганесон",
            "гафний", "тантал", "вольфрам", "рений", "осмий", "иридий", "платина", "золото",
            "ртуть", "таллий", "свинец", "висмут", "полоний", "астат", "радон", "франций", "радий",
            "актиний", "торий", "протактиний", "уран", "нептуний", "плутоний", "америций", "кюрий",
            "берклий", "калифорний", "эйнштейний", "фермий", "менделевий", "нобелий", "лоуренсий",
            "резерфордий", "дубний", "сиборгий", "борий", "хассий", "мейтнерий", "дармштадтий",
            "рентгений", "коперниций", "нихоний", "флеровий", "московий", "ливерморий", "теннессин"
    };

    @Override
    public String getRandomWord() {
        Random rand = new Random();
        return words[rand.nextInt(words.length)];
    }
}
