import java.util.Random;

public class Food implements Topics{

    private static String[] words = {
            "хлеб", "молоко", "сыр", "масло", "яйцо", "мясо", "рыба", "курица",
            "сосиска", "колбаса", "бекон", "котлета", "пельмени", "вареники", "борщ", "суп",
            "салат", "огурец", "помидор", "картофель", "морковь", "капуста", "лук", "чеснок",
            "грибы", "яблоко", "груша", "банан", "апельсин", "лимон", "виноград", "арбуз", "дыня",
            "ягоды", "малина", "клубника", "черника", "вишня", "персик", "слива", "ананас", "киви",
            "манго", "рис", "гречка", "макароны", "каша", "булочка", "пирог", "вода", "чай", "кофе",
            "сок", "молоко", "кефир", "йогурт", "лимонад", "газировка", "квас", "компот", "морс",
            "вино", "пиво", "шампанское", "водка", "коньяк", "ром", "виски", "ликер"
    };

    @Override
    public String getRandomWord() {
        Random rand = new Random();
        return words[rand.nextInt(words.length)];
    }
}
