import java.util.Random;

public class Nature implements Topics{

    private static final String[] words = {
            "дерево", "цветок", "трава", "куст", "лес", "парк", "луг", "поле",
            "гора", "река", "озеро", "море", "океан", "водопад", "пещера", "пустыня", "джунгли",
            "болото", "пруд", "ручей", "скала", "утес", "долина", "каньон", "вулкан",
            "ледник", "айсберг", "снег", "дождь", "град", "туман", "облако", "ветер",
            "буря", "ураган", "солнце", "луна", "звезда", "небо", "радуга", "гром",
            "молния", "роса", "пыльца", "листья", "корни", "ветви", "песок", "галька"
    };

    @Override
    public String getRandomWord() {
        Random rand = new Random();
        return words[rand.nextInt(words.length)];
    }
}
